flow/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }

application     pimpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         10;

deltaT          0.001;

writeControl    adjustable;
writeInterval   0.1;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
runTimeModifiable true;

adjustTimeStep yes;
maxCo          1.0;
maxDeltaT      0.001;

functions
{
    forceCoeffs
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   10;
        patches         (cylinder);
        rho             rhoInf;
        rhoInf          1.0;
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        CofR            (0.5 0.25 0);
        pitchAxis       (0 0 1);
        magUInf         1.0;
        lRef            0.2;
        Aref            0.2;
    }
}
