flow/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions [0 1 -1 0 0 0 0];
internalField uniform (1.0 0 0);
boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue
        {
            type        sine;
            frequency   1.0;
            amplitude   0.5;
            scale       (1 0 0);
    	    level       (1.0 0 0);
    	}
    }



    outlet       { type zeroGradient; }
    walls        { type noSlip; }
    cylinder     { type noSlip; }
    frontAndBack { type empty; }
}
