flow/system/fvSchemes
FoamFile { version 2.0; format ascii; class dictionary; object fvSchemes; }
ddtSchemes      { default         Euler; }
gradSchemes
{ 
  default         Gauss linear; 
  grad(U)         cellLimited Gauss linear 1;
}
divSchemes
{
    default                          none;
    div(phi,U)                       Gauss linearUpwindV grad(U);
    div(phi,k)                       Gauss limitedLinear 1;
    div(phi,omega)                   Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U)))))    Gauss linear;
}
laplacianSchemes { default         Gauss linear corrected; }
interpolationSchemes { default     linear; }
snGradSchemes   { default          corrected; }
wallDist
{
    method meshWave;
}
