flow/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }

solvers
{
    p
    {
        solver           GAMG;
        smoother         GaussSeidel;
        tolerance        1e-06;
        relTol           0.05;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        nCellsInCoarsestLevel 100;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }
    pFinal
    {
        $p;
        relTol           0;
    }
    "(U|k|omega)"
    {
        solver           smoothSolver;
        smoother         symGaussSeidel;
        tolerance        1e-07;
        relTol           0.1;
        nSweeps          1;
    }
    "(U|k|omega)Final"
    {
        $U;
        relTol           0;
    }
}

PIMPLE
{
    nOuterCorrectors          3;
    nCorrectors               2;
    nNonOrthogonalCorrectors  1;
    momentumPredictor         yes;
    consistent                yes;
}

relaxationFactors
{
    fields
    {
        p     0.3;
    }
    equations
    {
        "U.*"     0.5;
        "k.*"     0.5;
        "omega.*" 0.5;
    }
}
